{
  "query": "Frontend: Next.js + React, Backend: Node.js (NestJS) or Django or FastAPI, Database: PostgreSQL, Cache: Redis, Real-time: WebSockets, WebRTC, or Supabase Realtime, Infrastructure: Azure, Mobile: React Native",
  "timestamp": "2025-11-25T01:44:48.725989",
  "depth": "adaptive",
  "search_results": [],
  "key_findings": [
    "\"**Full-Stack Type Safety & API Contracts:** Leverage TypeScript across Next.js (frontend), NestJS (backend), and React Native (mobile) to enforce strong API contracts and reduce runtime errors, significantly improving developer experience and maintainability.\",",
    "\"**Infrastructure as Code (IaC) with Terraform:** Mandate Terraform for all Azure resource provisioning. This ensures consistent, repeatable, and auditable infrastructure deployments, crucial for high-complexity projects and disaster recovery.\",",
    "\"**Optimized Data Flow & Caching:** Implement a multi-layered caching strategy using Redis for frequently accessed data (e.g., API responses, session data) to reduce database load on PostgreSQL and improve application responsiveness across web and mobile.\",",
    "\"**Scalable Real-time Communication:** Choose between WebSockets (for granular control and custom protocols) or Supabase Realtime (for managed, rapid development) based on specific real-time needs, ensuring robust, low-latency communication for interactive features.\",",
    "\"**Performance-First Frontend & Mobile:** Prioritize Next.js's SSR/SSG capabilities and React Native's native modules/Hermes engine to deliver highly performant web and mobile experiences, focusing on fast initial loads and smooth interactions.\",",
    "\"**Robust API Design & Security:** Design RESTful APIs with clear versioning, comprehensive input validation (e.g., Pydantic for FastAPI, class-validator for NestJS), and implement OAuth 2.0/JWT for secure authentication and authorization across all client applications.\",",
    "\"**Unified Development Experience:** Consider a monorepo setup (e.g., using Nx or Turborepo) to manage Next.js, React Native, and shared TypeScript codebases, fostering code reuse and simplifying dependency management.\",",
    "\"**Managed Services for Operational Efficiency:** Utilize Azure's managed services (Azure Database for PostgreSQL, Azure Cache for Redis, Azure App Service/AKS) to offload operational overhead, allowing the team to focus on application development rather than infrastructure management.\",",
    "\"**Observability & Monitoring:** Integrate comprehensive logging, monitoring, and alerting (e.g., Azure Monitor, Application Insights) across all components to proactively identify and resolve performance bottlenecks and security incidents.\",",
    "\"**Data Persistence & Flexibility:** Leverage PostgreSQL's robust relational capabilities alongside its JSONB support for flexible schema requirements, providing a powerful and versatile data storage solution.\""
  ],
  "documentation_urls": [
    "https://react.dev/learn\",",
    "https://nestjs.com/docs/first-steps\",",
    "https://nextjs.org/docs\",",
    "https://docs.djangoproject.com/en/stable/\",",
    "https://developer.mozilla.org/en-US/docs/Web/API/WebSockets_API\",",
    "https://redis.io/docs/\",",
    "https://developer.mozilla.org/en-US/docs/Web/API/WebRTC_API\",",
    "https://www.postgresql.org/docs/\",",
    "https://fastapi.tiangolo.com/tutorial/\",",
    "https://supabase.com/docs/guides/realtime\","
  ],
  "code_examples": [],
  "best_practices": [],
  "confidence_score": 45,
  "sources_consulted": [
    "llm_research_text",
    "llm_research"
  ],
  "cached": false
}