{
  "query": "* Mention typical user scenarios.",
  "timestamp": "2025-11-24T21:39:14.728183",
  "depth": "adaptive",
  "search_results": [],
  "key_findings": [
    "\"**User-Centric Design is Paramount:** All React Native development should start by deeply understanding core user scenarios. This informs UI/UX design, feature prioritization, and technical architecture, ensuring the application truly meets real-world user needs and expectations.\",",
    "\"**Balance Cross-Platform Consistency with Native Feel:** While React Native promotes code reuse, successful implementation of user scenarios often requires balancing a consistent cross-platform experience with adapting to platform-specific UI/UX conventions (e.g., navigation patterns, alert dialogs) to provide a truly native and intuitive feel on both iOS and Android.\",",
    "\"**Robust State Management is Crucial for Dynamic Scenarios:** Typical user scenarios involving data fetching, complex user input, and real-time updates necessitate a well-defined state management strategy (e.g., React Context API, Redux, Zustand, MobX) to maintain data consistency, ensure responsiveness, and manage application complexity across the app.\",",
    "\"**Offline-First Approach Enhances Reliability:** Many mobile user scenarios occur in environments with intermittent or no connectivity. Designing for offline capabilities (e.g., local caching with AsyncStorage, optimistic UI updates, background data synchronization) significantly enhances user experience and app reliability, preventing frustration.\",",
    "\"**Performance Optimization is Critical for Engagement:** Smooth transitions, fast data loading, and responsive interactions are non-negotiable for retaining users. Proactive performance profiling and optimization (e.g., `React.memo`, `useCallback`, `useMemo`, virtualization for lists, image optimization) are essential for common user flows to prevent jank and slow loading times.\",",
    "\"**Accessibility is a Core Requirement, Not an Afterthought:** User scenarios must account for diverse user abilities. Implementing accessibility features (e.g., screen reader support, adequate touch target sizes, sufficient contrast ratios, semantic elements) from the outset ensures a broader, more inclusive user base and often improves general usability.\",",
    "\"**Effective Error Handling and Feedback Build Trust:** Users will inevitably encounter errors (e.g., network issues, invalid input, server failures). Implementing clear, actionable error messages, graceful degradation for unexpected scenarios, and visual feedback (e.g., loading indicators) is crucial for maintaining user trust and guiding them through issues.\",",
    "\"**Secure Handling of User Data and Interactions is Non-Negotiable:** Scenarios involving personal data, authentication, or sensitive operations demand robust security measures. This includes secure data storage, proper API key management, thorough input validation, and exclusive use of secure communication protocols (HTTPS).\"",
    "\"https://reactnative.dev/docs/getting-started\",",
    "\"https://reactnative.dev/docs/accessibility\","
  ],
  "documentation_urls": [
    "https://reactnative.dev/docs/platform-specific-code\"",
    "https://reactnative.dev/docs/accessibility\",",
    "https://jsonplaceholder.typicode.com/posts?_limit=5'",
    "https://reactnavigation.org/docs/getting-started/\",",
    "https://reactnative.dev/docs/asyncstorage\",",
    "https://reactnative.dev/docs/getting-started\",",
    "https://reactnative.dev/docs/performance\",",
    "https://reactnative.dev/docs/network\","
  ],
  "code_examples": [],
  "best_practices": [],
  "confidence_score": 45,
  "sources_consulted": [
    "llm_research_text",
    "llm_research"
  ],
  "cached": false
}